export const roadSigns = [
  {
    key: "uturn",
    name: "掉头",
    path: "M370.08 193.376C370.08 53.088 462.048 0 550.72 0c88.672 0 180.896 53.84 180.896 194.144V1024H619.04V194.144c0-65.472-26.944-89.008-68.32-89.008-41.376 0-75.104 22.864-74.8 88.24h64.224L421.648 573.136 303.152 193.376H370.08z",
  },
  {
    key: "left_uturn",
    name: "左转+掉头",
    path: "M697.056 1024h-128.448V640c0-17.52-16.224-41.76-48.672-41.76-32.448 0-49.36 24.08-49.36 41.76v156.576h65.92L439.84 1024 343.824 796.576h66.592V640c0-41.76 29.744-75.456 60.848-91.616 31.088-16.16 74.352-8.096 97.344 3.52V448l-96.336-96v128L311.712 192.256 472.272 0v128.768L695.84 352l1.216 672z",
  },
  {
    key: "left",
    name: "左转",
    path: "M456.784 146.352V0.24l-136.96 250.56 136.96 250.448v-146.096l137.12 92.752V1023.04h109.488V313.392z",
  },
  {
    key: "straight_left",
    name: "直行+左转",
    path: "M619.824 1024V446.784h84.464L577.408 0 446 446.784h84.144v303.728l-135.104-136.096V446.352L320.016 718.736l75.04 258.688v-153.504l135.104 128.16V1024z",
  },
  {
    key: "straight_uturn",
    name: "直行+掉头",
    path: "M588.864 0l115.168 447.872h-77.216V1024H544.448V447.872H471.792L588.864 0z m-44.56 551.92V640c0-17.52-16.16-41.76-48.512-41.76-32.32 0-49.168 24.08-49.168 41.76v156.576h65.68L415.984 1024 320.304 796.576h66.352V640c0-41.76 29.648-75.456 60.64-91.616 30.992-16.16 74.096-8.096 97.008 3.52z",
  },
  {
    key: "straight",
    name: "直行",
    path: "M461.536 447.872H376.192L512.896 0l133.12 447.872h-89.248V1024H461.536z",
  },
  {
    key: "right",
    name: "右转",
    path: "M559.356062 144.257969V0.236308l135.483076 247.004554-135.483076 246.862769v-144.021662l-135.640616 91.435323v566.980923H315.423508V308.901415z",
  },
  {
    key: "straight_right",
    name: "直行+右转",
    path: "M404.176 1024V446.784H319.712L446.592 0l131.408 446.784h-84.144v303.728l135.104-136.096V446.352l75.04 272.384-75.04 258.688v-153.504l-135.104 128.16V1024z",
  },
  {
    key: "left_right",
    name: "左转+右转",
    path: "M512.064 288.48l159.392-159.68V0l160 192.256-160 287.744v-128l-96 96v576h-126.784V448l-96-96v128l-160-287.744L352.672 0v128.768z",
  },
  {
    key: "all_direction",
    name: "所有方向",
    path: "M456.944 657.488V447.872h-90.832L512.464 0l143.952 447.872h-96.528v209.04l112.16-95.296v-128.768l160.288 192.256-160.304 287.744v-128l-112.144 95.104V1024H456.944v-143.472l-104.304-95.68v128L192.336 625.104l160.32-192.256V561.6z",
  },
  {
    key: "variable",
    name: "可变车道",
    path: "",
  },
  {
    key: "tidal_lane",
    name: "潮汐车道",
    path: "",
  },
  {
    key: "bus_only",
    name: "公交专用",
    path: "",
  },
  {
    key: "none",
    name: "无",
    path: "",
  },
  {
    hide: true,
    key: "reverse_straight",
    name: "逆行",
    path: "m465.999916,1.936573l2.000937,575.397813l-94.666839,-1.333336l138.666919,446.667481l137.333584,-445.334145l-85.333489,-1.333336l0,-576.00105",
  },
];

//根据车道获取默认路标
export function getRoadDefaultSign(wayIndex: number): string {
  let roadSignKey = "";
  console.log(wayIndex);
  switch (wayIndex) {
    case 0:
    case 1:
    case 2:
      roadSignKey = "reverse_straight";
      break;
    case 3:
      roadSignKey = "left";
      break;
    case 4:
      roadSignKey = "straight";
      break;
    case 5:
      roadSignKey = "straight_right";
      break;
    default:
      roadSignKey = "straight";
  }
  let roadSignPath = roadSigns.find((s) => s.key === roadSignKey)?.path;
  if (roadSignPath) {
    return roadSignPath;
  }
  return "";
}
